src/CFD/heatedplate6.1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 -90)    // 0
    (225 0 -90)  // 1
    (225 45 -90) // 2
    (0 45 -90)   // 3
    (0 0 0)      // 4
    (225 0 0)    // 5
    (225 45 0)   // 6
    (0 45 0)     // 7

    (450 0 -90)  // 8
    (450 45 -90) // 9
    (450 0 0)    // 10
    (450 45 0)   // 11
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 12 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (60 12 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    upperWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (2 6 11 9) 
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    heatedWall
    {
        type wall;
        faces
        (
            (8 10 5 1)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (9 11 10 8)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (1 2 9 8)
            (5 10 11 6)
        );
    }
);

// ************************************************************************* //
